import java.util.Scanner;

/*package homework_14;
 */

import java.util.Scanner;

/*
Task 3
Подсчет гласных и согласных
Напишите программу, которая просит пользователя ввести слово и подсчитывает количество
гласных и согласных букв в этом слове.
 */
/*public class Task3 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите слово:");
        scanner.nextLine();
        String vowels = "a, e, i, o, u, A, E, I, O, U";

        int sumVowels = 0;
        int sumConsonans = 0;
        for (int i = 0; i < vowels.length(); i++){
            char c = vowels.charAt(i);
            if (isVowel(c)) {
                sumVowels++;
            }




        public static boolean isVowel(char c) {
            return "aeiouAEIOU" .indexOf(c) ! -1;


        }
}/*

